

#ifndef _CONFIG_H
#define _CONFIG_H

typedef struct _G_CONFIG G_CONFIG;

#include        "a.h"
#include	"b.h"

/*定义结构体*/

struct _G_CONFIG
/*-----------------------------------------------------------------------------
 * \brief     数据库结构
 *-----------------------------------------------------------------------------*/
{
    int n_test;
    char* p_ch_test; 
    Stu_B* p_stu_B;
    Stu_A* p_stu_A;
};

    void
start_CONFIG ( );

/*-----------------------------------------------------------------------------
 * \brief    初始化数据库
 * \param[in]         
 * \param[out]   G
 * \return                                                                                                                                        
 * \free  free_CONFIG()
 *-----------------------------------------------------------------------------*/

    void
free_CONFIG (  );

/*-----------------------------------------------------------------------------
 * \brief    删除数据库
 * \param[in]    G   
 * \param[out]   
 * \return                                                                                                                                         
 * \free  
 *-----------------------------------------------------------------------------*/

#endif
